{"class_name": "Sequential", "optimizer": {"beta_2": 0.9990000128746033, "epsilon": 1e-08, "name": "Adam", "lr": 0.0010000000474974513, "beta_1": 0.8999999761581421}, "sample_weight_mode": null, "loss": "str", "keras_version": "1.0.3", "config": [{"class_name": "Convolution2D", "config": {"nb_row": 2, "init": "glorot_uniform", "nb_col": 2, "batch_input_shape": [null, 3, 60, 47], "W_regularizer": null, "name": "convolution2d_1", "bias": true, "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "subsample": [1, 1], "trainable": true, "b_constraint": null, "activation": "relu", "dim_ordering": "th", "b_regularizer": null, "nb_filter": 32, "input_dtype": "float32"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "dim_ordering": "th", "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_row": 2, "init": "glorot_uniform", "nb_col": 2, "W_regularizer": null, "name": "convolution2d_2", "bias": true, "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "subsample": [1, 1], "trainable": true, "b_constraint": null, "activation": "relu", "dim_ordering": "th", "b_regularizer": null, "nb_filter": 64}}, {"class_name": "Convolution2D", "config": {"nb_row": 2, "init": "glorot_uniform", "nb_col": 2, "W_regularizer": null, "name": "convolution2d_3", "bias": true, "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "subsample": [1, 1], "trainable": true, "b_constraint": null, "activation": "relu", "dim_ordering": "th", "b_regularizer": null, "nb_filter": 64}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "dim_ordering": "th", "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_row": 2, "init": "glorot_uniform", "nb_col": 2, "W_regularizer": null, "name": "convolution2d_4", "bias": true, "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "subsample": [1, 1], "trainable": true, "b_constraint": null, "activation": "relu", "dim_ordering": "th", "b_regularizer": null, "nb_filter": 64}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "relu", "W_regularizer": null, "name": "dense_1", "bias": true, "input_dim": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "output_dim": 100, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "relu", "W_regularizer": null, "name": "dense_2", "bias": true, "input_dim": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "output_dim": 100, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "softmax", "W_regularizer": null, "name": "dense_3", "bias": true, "input_dim": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "output_dim": 191, "b_regularizer": null}}]}